Полигон/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОклада</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Полигон/src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ДанныеГрафика</schedule>
  <scheduleValue>InformationRegister.ДанныеГрафика.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.ДанныеГрафика.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Полигон/src/Documents/НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Начисления
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Показатель = ТекСтрокаНачисления.СуммаОклада;
	КонецЦикла;
    Движения.Начисления.Записать();
	
	Для Каждого Движение Из Движения.Начисления Цикл
		
		Если Движение.ВидРасчета <> ПланыВидовРасчета.Начисления.Оклад Тогда
			Продолжить;
		КонецЕсли;
		
		План = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия);
		Факт = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия);
		
		Результат = Движение.Показатель / План[0].РабочихДней * Факт[0].РабочихДней;
		Движение.Результат = Результат;
		Движения.Начисления.Записать( ,Истина);
		
	КонецЦикла;
	
КонецПроцедуры
